app/Http/Livewire/Post/View.php

    public function getCommentsProperty() {
        $comments = Comment::where('post_id', $this->post->id)->latest()->paginate($this->perPage);
---
select count(*) as aggregate from `comments` where `post_id` = 3

    public function getLikedStatus() {
        $this->liked = PostLike::where('post_id', $this->post->id)
                               ->where('user_id', Auth::id())
                               ->first();
---
select * from `post_likes` where `post_id` = 3 and `user_id` = 1 limit 1

    public function getLikesCount() {
        $this->likesCount = PostLike::where('post_id', $this->post->id)
                                    ->count();
---
select count(*) as aggregate from `post_likes` where `post_id` = 3

    public function getVerticalProperty()
    {
        if($this->postType == 1)
        {
            if (isset($this->post->images()->first()->path))
            {
                $image = $this->post->images()->first()->path;
---
select * from `images` where `images`.`post_id` = 3 and `images`.`post_id` is not null limit 1