app/Http/Livewire/Timeline.php

select * from `posts` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `posts`
---
    public function getPostsProperty(): LengthAwarePaginator {
        $posts = Post::query()
                    ->latest()
                    ->paginate($this->perPage);