app/Http/Controllers/ProfileController.php

    public function index($id)
    {
        $user = User::find($id);
---
select * from `users` where `users`.`id` = '1' limit 1